---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.CoolingCoilType
source: html/e0348fd6-2ca2-883d-584c-33e2d3f06023.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.CoolingCoilType Property

The type of cooling coil. Note this property change would reset the chilled water loop.

## Syntax (C#)
```csharp
public AirCoolingCoilType CoolingCoilType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration